English/NewWords/friendsNote.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Friends</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="title" content="Friends"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-17 02:53:42 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#english">主页</a></div>


</head>
<body>


<div id="content">
<h1 class="title">Friends</h1>



<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 friend with</a></li>
<li><a href="#sec-2">2 butter up</a></li>
<li><a href="#sec-3">3 be way too</a></li>
<li><a href="#sec-4">4 get past</a></li>
<li><a href="#sec-5">5 freaked out</a></li>
<li><a href="#sec-6">6 let's just say / footage</a></li>
<li><a href="#sec-7">7 screw you</a></li>
<li><a href="#sec-8">8 i got to go</a></li>
<li><a href="#sec-9">9 on good terms</a></li>
<li><a href="#sec-10">10 benefit of the doubt</a></li>
<li><a href="#sec-11">11 it meant a lot to me</a></li>
<li><a href="#sec-12">12 meant to be</a></li>
<li><a href="#sec-13">13 pearls of wisdom</a></li>
<li><a href="#sec-14">14 who's who</a></li>
<li><a href="#sec-15">15 dial down</a></li>
<li><a href="#sec-16">16 blow off</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> friend with</h2>
<div class="outline-text-2" id="text-1">


<p> 
  why do i friend with thost people.
</p>
<p>
  我怎么会和这些人交上朋友
</p>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> butter up</h2>
<div class="outline-text-2" id="text-2">


<p> 
  i just want to butter her up first.
</p>
<p>
  butter sb up 用花言巧语讨好某人
</p>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> be way too</h2>
<div class="outline-text-2" id="text-3">


<p> 
  she's way too emotional.
</p>
<p>
  she's way too young for him.
</p>
<p>
  太(与去掉way意思一样)
</p>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> get past</h2>
<div class="outline-text-2" id="text-4">


<p> 
  we have to get past this.
</p>
<p>
  我们必须忘记它（8.15）
</p>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> freaked out</h2>
<div class="outline-text-2" id="text-5">


<p> 
  i'm all freaked out.
</p>
<p>
  我被你们吓着了
</p>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> let's just say / footage</h2>
<div class="outline-text-2" id="text-6">


<p> 
  well, let's just say it's ironic how footage of someone being born can make you want to kill yourself.
</p>
<p>
  这么说吧，讽刺的是看某人出生的镜头能使人想自杀
</p>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> screw you</h2>
<div class="outline-text-2" id="text-7">


<p> 
  screw you gays, you don't have to do it.
</p>
<p>
  去你的
</p>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> i got to go</h2>
<div class="outline-text-2" id="text-8">


<p> 
  我得走了
</p>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> on good terms</h2>
<div class="outline-text-2" id="text-9">


<p> 
  it's jsut that we didn't really end things on such good terms.
</p>
<p>
  良好的关系
</p>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> benefit of the doubt</h2>
<div class="outline-text-2" id="text-10">


<p> 
  you're comming on a little strong, but i'm going to give you the benefit of the doubt.
</p>
<p>
  假定某人无罪（因证据不足）
</p>


</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> it meant a lot to me</h2>
<div class="outline-text-2" id="text-11">


<p> 
  这对我意义重大
</p>


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> meant to be</h2>
<div class="outline-text-2" id="text-12">


<p> 
  it wasn't meant to be. 本不该如此
</p>
<p>
  命中注定
</p>


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> pearls of wisdom</h2>
<div class="outline-text-2" id="text-13">


<p> 
  This is such a great party! 35 years, very impressive, do you guys have any pearls of wisdom?
</p>
<p>
  至理名言
</p>


</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> who's who</h2>
<div class="outline-text-2" id="text-14">


<p> 
  you collective dating record reads like the who's who of human crap.
</p>
<p>
  名人录
</p>


</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> dial down</h2>
<div class="outline-text-2" id="text-15">


<p> 
  we're dial down the crazy.
</p>


</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> blow off</h2>
<div class="outline-text-2" id="text-16">


<p> 
  please don't blow her off. 不要和她分手
</p>




<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>

</body>
</html>
